Revit 2015 API
Material.MaterialCagtegory Property
 The name of the material category, e.g. 'Wood'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Autodesk Revit 2015, please use the MaterialCategory property instead.")]
public string MaterialCagtegory { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Autodesk Revit 2015, please use the MaterialCategory property instead.")> _
Public Property MaterialCagtegory As String
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Autodesk Revit 2015, please use the MaterialCategory property instead.")]
public:
property String^ MaterialCagtegory {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
Material Class
Autodesk.Revit.DB Namespace